package org.mpei.C37_118_2011_ALL_FRAME.frame.lowFrame;

import lombok.Getter;
import lombok.Setter;
import org.mpei.C37_118_2011_ALL_FRAME.dataPacketConfiguration.dataConfiguration;

import java.util.ArrayList;

@Setter
@Getter
public class Frame_Configuration_IEEE_C37_118_2011 {
    /**
     * -----------------------------------------------------------------------------------------------------------------
     * Служебный байт (не известно для чего)----------------------------------------------------------------------------
     * -----------------------------------------------------------------------------------------------------------------
     */
    private String config;                                                                              //Размер: 1 байт

    /**
     * -----------------------------------------------------------------------------------------------------------------
     * Разрешение временной метки---------------------------------------------------------------------------------------
     * -----------------------------------------------------------------------------------------------------------------
     */
    private String resolution;                                                                          //Размер: 3 байт

    /**
     * -----------------------------------------------------------------------------------------------------------------
     * Количество PMU---------------------------------------------------------------------------------------------------
     * -----------------------------------------------------------------------------------------------------------------
     */
    private int numberPMU;                                                                              //Размер: 2 байт

    /**
     * Массив структур для Config пакетов protocol IEEE C37.118-2011
     */
    private ArrayList<dataConfiguration> dataPmu = new ArrayList() {
    };

    /**
     * -----------------------------------------------------------------------------------------------------------------
     * Конструктор:-----------------------------------------------------------------------------------------------------
     * - Определяет начальную информацию о количестве PMU;--------------------------------------------------------------
     * -----------------------------------------------------------------------------------------------------------------
     */
//    public Frame_Configuration_IEEE_C37_118_2011() {
//        this.config = "0";
//        this.resolution = "0";
//        this.numberPMU = 0;
//    }

    /**
     * -----------------------------------------------------------------------------------------------------------------
     * Метод по заполнению массива dataPmu, нужным количеством шаблонов структур----------------------------------------
     * -----------------------------------------------------------------------------------------------------------------
     */
    public void completionDataConfiguration() {
        for (int i = 0; i < this.numberPMU; i++) {
            this.dataPmu.add(new dataConfiguration());
        }
    }

    /**
     * -----------------------------------------------------------------------------------------------------------------
     * Вспомогательный метод для представления информации в человекочитаемом виде---------------------------------------
     * -----------------------------------------------------------------------------------------------------------------
     */
    @Override
    public String toString() {
        return "Frame_Configuration_IEEE_C37_118_2011 {" +
                "Config: " + config + '\n' +
                "Resolution: " + resolution + '\n' +
                "Number PMU: " + numberPMU + '\n' +
//                "toStringDataConfiguration" + toStringDataConfiguration() + '\n' +
//                "dataPmu: " + dataPmu + '\n' +
                '}';
    }

    /**
     * -----------------------------------------------------------------------------------------------------------------
     * Метод для корректного отображения вложенной структуры------------------------------------------------------------
     * -----------------------------------------------------------------------------------------------------------------
     */
    public String toStringDataConfiguration() {
        StringBuilder dataConf = new StringBuilder();
        for (int i = 0; i < this.numberPMU; i++) {
            dataConf.append(dataPmu.get(i).toString()).append("\n");
        }
        return dataConf.toString();
    }

}
