package org.mpei.dataPacket;

import lombok.Getter;
import lombok.Setter;

@Setter
@Getter
/**---------------------------------------------------------------------------------------------------------------------
 * Класс для аналоговых значений. Содержит одно поле значения с плавающей точкой----------------------------------------
 * -------------------------------------------------------------------------------------------------------------------*/
public class AnalogValues_IEEE_C37_118_2011 {
    private float value;
}
